### Manejo de Datos Faltantes

In [37]:
import pandas as pd

datos = pd.read_csv("clientes.csv")

print(datos["nombre"])

0       Juan
1      Luisa
2        NaN
3     Carmen
4        NaN
5      Mario
6      Pedro
7    Gustavo
8     Carlos
Name: nombre, dtype: object

In [38]:
filtro = datos["nombre"].isnull()
datos[filtro]

  nombre  edad  ingreso
2    NaN  70.0  20000.0
4    NaN   NaN      NaN

In [39]:

datos.dropna()

   nombre  edad  ingreso
0    Juan  35.0  15800.0
1   Luisa  25.0  17000.0
3  Carmen  49.0  22000.0
5   Mario  30.0  15800.0

In [40]:
datos.dropna(subset=["nombre", "ingreso"])
#Mantener cambios en datos
#print(datos.dropna(subset=["nombre", "ingreso"]),inplace=True)

   nombre  edad  ingreso
0    Juan  35.0  15800.0
1   Luisa  25.0  17000.0
3  Carmen  49.0  22000.0
5   Mario  30.0  15800.0
6   Pedro   NaN  17400.0

In [41]:
datos.fillna(0)

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2        0  70.0  20000.0
3   Carmen  49.0  22000.0
4        0   0.0      0.0
5    Mario  30.0  15800.0
6    Pedro   0.0  17400.0
7  Gustavo  27.0      0.0
8   Carlos   0.0      0.0

In [43]:
datos["nombre"].fillna("DESCONOCIDO")

0           Juan
1          Luisa
2    DESCONOCIDO
3         Carmen
4    DESCONOCIDO
5          Mario
6          Pedro
7        Gustavo
8         Carlos
Name: nombre, dtype: object

In [45]:
valores_por_defecto = {
    "nombre":"DESCONOCIDO",
    "edad":18,
    "ingreso":1000
}

datos.fillna(value=valores_por_defecto)

        nombre  edad  ingreso
0         Juan  35.0  15800.0
1        Luisa  25.0  17000.0
2  DESCONOCIDO  70.0  20000.0
3       Carmen  49.0  22000.0
4  DESCONOCIDO  18.0   1000.0
5        Mario  30.0  15800.0
6        Pedro  18.0  17400.0
7      Gustavo  27.0   1000.0
8       Carlos  18.0   1000.0

In [46]:
promedio = datos["ingreso"].mean()
mediana = datos["ingreso"].median()
moda = datos["ingreso"].mode()[0]

print(promedio, mediana, moda)
print(datos["ingreso"].fillna(moda))

18000.0 17200.0 15800.0
0    15800.0
1    17000.0
2    20000.0
3    22000.0
4    15800.0
5    15800.0
6    17400.0
7    15800.0
8    15800.0
Name: ingreso, dtype: float64